In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'city':['new york','london','paris','tokyo','new york','paris'],
    'price':[200,150,300,250,180,320]
    })

In [5]:
df.head()

       city  price
0  new york    200
1    london    150
2     paris    300
3     tokyo    250
4  new york    180

In [6]:
##calculate the meqn price of the city

In [12]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [13]:
mean_price

{'london': 150.0, 'new york': 190.0, 'paris': 310.0, 'tokyo': 250.0}

In [14]:
##replace the city with its main price
df['city_encoder'] = df['city'].map(mean_price)

In [15]:
df

       city  price  city_encoder
0  new york    200         190.0
1    london    150         150.0
2     paris    300         310.0
3     tokyo    250         250.0
4  new york    180         190.0
5     paris    320         310.0